# Задание 1
'''
a = int(input("Введите число: "))
b = int(input("Введите число: "))
c = int(input("Введите число: "))
print ("Cумма чисел :", a + b + c)
print ("Произведение чисел :", a * b * c)
'''
# Задание 2
'''
value = int(input("Введите свою ЗП за месяц: "))
num2 = int(input("Введите свой месячный платёж по кредиту: "))
num3 = int(input("Введите свою задолженность по комунальным услугам: "))
print ("Остаток: ", value - num2 - num3)
'''
# Задание 3
'''
d1 = int(input("Введите длинну первой диагонали ромба: "))
d2 = int(input("Введите длинну второй диагонали ромба: "))
print("Площадь ромба: ", d1 * d2)
'''
# Задание 4
'''
print ("To be \n"
       "or not \n"
       "to be")
'''
# Задание 5
'''
print ('"Life is what happens \n\t', "\t"*4,
       "when\n", "\t"*6,
       'you`re busy  making other plans."\n', "\t"*15,
       "John Lennon.")
'''